---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductFinishDescription
source: html/45e92c7d-337d-04b7-96e6-4223ec8d637e.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductFinishDescription Property

The product finish description of the fabrication part.

## Syntax (C#)
```csharp
public string ProductFinishDescription { get; }
```